blog/regexp.org
#+SETUPFILE: ../setup.org
#+TITLE: 正規言語， NFA, DFA, および正規表現の否定について

*正規表現* (/regular expression/)について勉強したことをまとめておく．
この記事は解説というより備忘録のようなものなので，
あまりこの記事だけで理解することは期待しないでほしいが，
検索するときの助けにはなると思う．
まず正規表現には長い長い，理論と実装が別々に進歩してきた歴史があり，
これが正規表現の定義だ，と断言することは難しい．
理論的には， *決定性有限オートマトン* (/deterministic finite automaton/, DFA)
が受理する文字列の集合が *正規言語* (/regular language/)であって，
正規言語を表す記法が正規表現であるといえる．
しかしいわゆる正規表現エンジンは，
正規言語を超える言語を認識できるように実装されていることが多い．
たとえば正規言語はかっこの対応を判定できないので，
かっこの対応を判定できる正規表現エンジンは理論以上の実装になっている，
ということである． より強い言語を認識できるほうが便利に思えるかもしれないが，
認識できる言語を正規言語に限定することで， さまざまな嬉しい性質がついてくる． そこでここでは，
正規表現というものを正規言語を認識する表現というものにかぎって話を進めようと思う．

正規表現は， *連接* (/concatenation/), *選択* (/selection/), *閉包* (/closure/)
のみっつの基本演算からなる表現である．
連接とは ~/ab/~ のように正規表現と正規表現を隣りあわせた表現，
選択とは ~/a|b/~ のように正規表現と正規表現を ~|~ で区切った表現，
閉包とは ~a*~ のように正規表現に ~*~ をつけた表現をいう．
数式と数式を + や - の記号で組みあわせたものもまた数式であるように，
正規表現と正規表現を連接や洗濯で組みあわせたものもまた正規表現である
(これを *閉性* (/closure property/) といい， 正規表現は連接や選択，
閉包について *閉じている* (/closed/) などという．
これは単純なものを組みあわせて複雑なものを組みたてるために重要な性質で，
たとえばモナドも ~(>>)~ などの演算について閉じているので複雑な表現ができるのである)．
/expression/ は *表現* と訳されているが，
*式* と訳すべきだったと考えるひとも多い．
一般に，式という言葉は閉じている演算を持つ表現にあてられるからである．

正規表現は， DFA と等価である．
言いかえるならば，正規表現は DFA に変換できるし，
DFA は正規表現に変換できる．
DFA とは /A/ = (/Q/, /∑/, /σ/, /q_0/, /F/) と定義される 5 つ組である．
ただし /Q/ は *状態* (/state/) の集合， /Σ/ は *記号* (/symbol/) の集合，
/σ : Q×Σ→Q/ は *遷移関数* (/transition function/),
/q_{0}∈Q/ は *初期* (/initial/) 状態,
/F⊂Q/ は *最終* (/final/) 状態の集合である．
正規表現と DFA が等価なことの証明，およびその変換方法については，参考文献を参照されたい．

さて， 正規表現の否定を直接求めることは困難である．
しかし， DFA の否定は簡単に求めることができる．
/A/ = (/Q/, /∑/, /σ/, /q_0/, /F/)
の否定は
@@html:<span class="overline"><em>@@A@@html:</em></span>@@ = (/Q/, /∑/, /σ/, /q_0/,  /Q/ \ /F/) とするだけでよい．
したがって， まず正規表現を DFA に変換し，
その否定を求めたあと， それをふたたび正規表現に戻すことで，
正規表現の否定を求めることができる．
否定があれば De Morgan の法則により積も求められる．
否定と積があれば差や排他的論理和も求められる．

ただ，このようにして求めた正規表現は巨大なものになりがちなので，
DFA の最小化などをする必要がある．
DFA の最小化は状態の同値類を定義し，
状態の集合をその同値類で割ることでおこなう．
状態の同値類は
 *穴埋めアルゴリズム* (/table-filling algorithm/)
で求めることができる．

* References

- Appel, Andrew W. 『最新コンパイラ構成技法』 2009.
- 新屋良磨, 鈴木勇介, 高田謙. 『正規表現技術入門』 2015.
