blog/regexp.html
<!DOCTYPE html>
<html>
<head>
<title>正規言語， NFA, DFA, および正規表現の否定について</title>
<!-- 2018-01-14 Sun 11:50 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<link rel="stylesheet" type="text/css" href="/css/prelude.css" />
<link rel="stylesheet" type="text/css" href="/css/highlight.css" />
</head>
<body>
<div id="content">
<h1 class="title">正規言語， NFA, DFA, および正規表現の否定について</h1>
<p>
<b>正規表現</b> (<i>regular expression</i>)について勉強したことをまとめておく．
この記事は解説というより備忘録のようなものなので，
あまりこの記事だけで理解することは期待しないでほしいが，
検索するときの助けにはなると思う．
まず正規表現には長い長い，理論と実装が別々に進歩してきた歴史があり，
これが正規表現の定義だ，と断言することは難しい．
理論的には， <b>決定性有限オートマトン</b> (<i>deterministic finite automaton</i>, DFA)
が受理する文字列の集合が <b>正規言語</b> (<i>regular language</i>)であって，
正規言語を表す記法が正規表現であるといえる．
しかしいわゆる正規表現エンジンは，
正規言語を超える言語を認識できるように実装されていることが多い．
たとえば正規言語はかっこの対応を判定できないので，
かっこの対応を判定できる正規表現エンジンは理論以上の実装になっている，
ということである． より強い言語を認識できるほうが便利に思えるかもしれないが，
認識できる言語を正規言語に限定することで， さまざまな嬉しい性質がついてくる． そこでここでは，
正規表現というものを正規言語を認識する表現というものにかぎって話を進めようと思う．
</p>

<p>
正規表現は， <b>連接</b> (<i>concatenation</i>), <b>選択</b> (<i>selection</i>), <b>閉包</b> (<i>closure</i>)
のみっつの基本演算からなる表現である．
連接とは <code>/ab/</code> のように正規表現と正規表現を隣りあわせた表現，
選択とは <code>/a|b/</code> のように正規表現と正規表現を <code>|</code> で区切った表現，
閉包とは <code>a*</code> のように正規表現に <code>*</code> をつけた表現をいう．
数式と数式を + や - の記号で組みあわせたものもまた数式であるように，
正規表現と正規表現を連接や洗濯で組みあわせたものもまた正規表現である
(これを <b>閉性</b> (<i>closure property</i>) といい， 正規表現は連接や選択，
閉包について <b>閉じている</b> (<i>closed</i>) などという．
これは単純なものを組みあわせて複雑なものを組みたてるために重要な性質で，
たとえばモナドも <code>(&gt;&gt;)</code> などの演算について閉じているので複雑な表現ができるのである)．
<i>expression</i> は <b>表現</b> と訳されているが，
<b>式</b> と訳すべきだったと考えるひとも多い．
一般に，式という言葉は閉じている演算を持つ表現にあてられるからである．
</p>

<p>
正規表現は， DFA と等価である．
言いかえるならば，正規表現は DFA に変換できるし，
DFA は正規表現に変換できる．
DFA とは <i>A</i> = (<i>Q</i>, <i>∑</i>, <i>σ</i>, <i>q<sub>0</sub></i>, <i>F</i>) と定義される 5 つ組である．
ただし <i>Q</i> は <b>状態</b> (<i>state</i>) の集合， <i>Σ</i> は <b>記号</b> (<i>symbol</i>) の集合，
<i>σ : Q×Σ→Q</i> は <b>遷移関数</b> (<i>transition function</i>),
<i>q<sub>0</sub>∈Q</i> は <b>初期</b> (<i>initial</i>) 状態,
<i>F⊂Q</i> は <b>最終</b> (<i>final</i>) 状態の集合である．
正規表現と DFA が等価なことの証明，およびその変換方法については，参考文献を参照されたい．
</p>

<p>
さて， 正規表現の否定を直接求めることは困難である．
しかし， DFA の否定は簡単に求めることができる．
<i>A</i> = (<i>Q</i>, <i>∑</i>, <i>σ</i>, <i>q<sub>0</sub></i>, <i>F</i>)
の否定は
<span class="overline"><em>A</em></span> = (<i>Q</i>, <i>∑</i>, <i>σ</i>, <i>q<sub>0</sub></i>,  <i>Q</i> \ <i>F</i>) とするだけでよい．
したがって， まず正規表現を DFA に変換し，
その否定を求めたあと， それをふたたび正規表現に戻すことで，
正規表現の否定を求めることができる．
否定があれば De Morgan の法則により積も求められる．
否定と積があれば差や排他的論理和も求められる．
</p>

<p>
ただ，このようにして求めた正規表現は巨大なものになりがちなので，
DFA の最小化などをする必要がある．
DFA の最小化は状態の同値類を定義し，
状態の集合をその同値類で割ることでおこなう．
状態の同値類は
 <b>穴埋めアルゴリズム</b> (<i>table-filling algorithm</i>)
で求めることができる．
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">References</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Appel, Andrew W. 『最新コンパイラ構成技法』 2009.
</li>
<li>新屋良磨, 鈴木勇介, 高田謙. 『正規表現技術入門』 2015.
</li>
</ul>
</div>
</div>
</div>
</body>
</html>
